Results/Aesop_Apis_Baseline_test_Results/Substitute_Get_Apis/2022-02-07_17-18-14.025891_200_Users_Substitute_Get_Apis_07_Feb_2022/2022-02-07_17-18-14.025891/absenceAPI_Baseline_test.yml
execution:
#- executor: jmeter
- concurrency: 200
  ramp-up: 200s
  hold-for: 60m
  scenario: SC01_Substitute_get_apis
 
scenarios:
  SC01_Substitute_get_apis:
    script: SC01_Substitute_get_apis.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed